:PROPERTIES:
:ID:       29e51758-77cd-4e8f-b56a-968dd42cb42a
:END:
#+title: #+title: introduzione a java

** conversione automatica a stringa
 Quando cerchiamo di concatenare a una stringa un operando di tipo diverso viene convertito automaticamente a stringa.

#+begin_src java
public class PensieroProfondo
    {
        public static void main(String[] args)
            {
                String s = "La risposta alla fondamentale sulla vita, l'universo e tutto quanto e' ";
                int v = 42;
                String risposta = s+v; // equivalente a String risposta = s+Integer.parseInt(v)
                System.out.println(risposta);
            }
}
#+end_src

#+RESULTS:
: La risposta alla fondamentale sulla vita, l'universo e tutto quanto e' 42

** Cast esplicito
Anteponendo il tipo desiderato tra parentesi all'espressione essa verrà convertita.
#+begin_src java
System.out.println((int)2.781828);
#+end_src

#+RESULTS:
: 2
